IRP/src/InformationRegisters/IntegrationInfo/IntegrationInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>IntegrationInfo</name>
  <resources>
    <name>Value</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>SecondValue</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <types>Date</types>
      <types>Boolean</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/IntegrationServer/Module.bsl
Function ConnectionSetting(IntegrationSettingName, AddInfo = Undefined) Export
	Return IntegrationServerReuse.ConnectionSetting(IntegrationSettingName, AddInfo);
EndFunction

Function ConnectionSettingTemplate(IntegrationType = Undefined, AddInfo = Undefined) Export
	Return  IntegrationServerReuse.ConnectionSettingTemplate(IntegrationType, AddInfo);
EndFunction

Function InfoRegSettingsStructure() Export
	Return IntegrationServerReuse.InfoRegSettingsStructure()
EndFunction

Procedure SaveFileToFileStorage(PathForSave, FileName, BinaryData) Export
    BinaryData.Write(PathForSave + ?(StrEndsWith(PathForSave, "\"), "", "\") + FileName);
EndProcedure

Procedure SaveSettingsInInfoReg(SettingsTab) Export

    For Each Row In SettingsTab Do
        Reg = InformationRegisters.IntegrationInfo.CreateRecordSet();
        Reg.Filter.IntegrationSettings.Set(Row.IntegrationSettings);
        Reg.Filter.Key.Set(Row.Key);
        
        If NOT ValueIsFilled(Row.Value) AND Row.SecondValue = Undefined Then
            Reg.Write();
            Continue;
        EndIf;
        
        FillPropertyValues(Reg.Add(), Row);
        Reg.Write();
        
    EndDo;
    
EndProcedure
